ERM/src/InformationRegisters/SalesOrdersComments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>SalesOrdersComments</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Problem</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrderProblem</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/SalesOrdersComments/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("ДанныеПроблем") Тогда
		
		ТаблицаДанныхПроблем = ДополнительныеСвойства.ДанныеПроблем;
		
		СтруктураПоиска = Новый Структура("Период, SalesOrder");
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ЗаписьНабора);
			СтрокаДанных = ТаблицаДанныхПроблем.НайтиСтроки(СтруктураПоиска);
			
			Если СтрокаДанных.Количество() > 0 Тогда
				
				СтруктураРеквизитовПроблемы = СтрокаДанных[0].СтруктураРеквизитов;
				
				Если ЗначениеЗаполнено(ЗаписьНабора.Problem) Тогда
					РегистрыСведений.SalesOrdersComments.ПерезаполнитьРеквизитыSalesOrderProblem(ЗаписьНабора.Problem, СтруктураРеквизитовПроблемы);
				Иначе
					ЗаписьНабора.Problem = РегистрыСведений.SalesOrdersComments.СоздатьSalesOrderProblem(СтруктураРеквизитовПроблемы);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Количество() = 0 И Замещение Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
